using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// <summary>
/// Автор - Кравчук Василий
/// </summary>
namespace Lesson2
{
    class Program
    {
        static void Main(string[] args)
        {
            #region Задание 1
            // 1. Написать метод, возвращающий минимальное из трёх чисел.
            #endregion

            #region Задание 2
            // 2. Написать метод подсчета количества цифр числа.
            #endregion

            #region Задание 3
            // 3. С клавиатуры вводятся числа, пока не будет введен 0. Подсчитать сумму всех нечетных положительных чисел.
            #endregion

            #region Задание 4
            // 4. Реализовать метод проверки логина и пароля. На вход метода подается логин и пароль.
            //    На выходе истина, если прошел авторизацию, и ложь, если не прошел (Логин: root, Password: GeekBrains).
            //    Используя метод проверки логина и пароля, написать программу: пользователь вводит логин и пароль, программа пропускает его дальше или не пропускает.
            //    С помощью цикла do while ограничить ввод пароля тремя попытками.
            #endregion

            #region Задание 5
            // 5. а) Написать программу, которая запрашивает массу и рост человека, вычисляет его индекс массы и сообщает, нужно ли человеку похудеть, набрать вес или всё в норме.
            //    б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.
            #endregion

            #region Задание 6
            // 6. * Написать программу подсчета количества «хороших» чисел в диапазоне от 1 до 1 000 000 000. «Хорошим» называется число, которое делится на сумму своих цифр.
            //    Реализовать подсчёт времени выполнения программы, используя структуру DateTime.
            #endregion

            #region Задание 7
            // 7. a) Разработать рекурсивный метод, который выводит на экран числа от a до b (a < b).
            //    б) *Разработать рекурсивный метод, который считает сумму чисел от a до b.
            #endregion

        }
    }
}
